InformationRegisters/DMS_ДанныеФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_ДанныеФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_СправочнаяИнформацияПоФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_СправочнаяИнформацияПоФИО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыЗначенийФИО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/DMS_ТипыЗначенийФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ТипыЗначенийФИО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фамилия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчество</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/CRM_ПотенциальныеКонтрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>CRM_ПотенциальныеКонтрагенты</Name>
			<Comment>Потенциальные клиенты</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Comment>Вид контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Comment>Форма собственности контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Ссылка на организацию для собственных филиалов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>Код ОКПО контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИМНС</Name>
					<Comment>Код ИМНС контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Дополнительная информация о контрагенте</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Если флажок установлен, то при заполнении приходных документов от этого контрагента, товары будут поступать без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения контактного лица</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Пол контактного лица</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший запись о контрагенте</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанных</Name>
					<Comment>Согласие на обработку персональных данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтветов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанныхДата</Name>
					<Comment>Дата согласия на обработку персональных данных</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Имя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Comment>Отчество</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодBCS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласенНаКоммуникацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СемейноеПоложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоМестуРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>Банковский счет контрагента, используемый по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтношений</Name>
					<Comment>Вид отношений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимоотношений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТелефон</Name>
					<Comment>Основной телефон контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Renault_ВедушийКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставСемьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родственник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/DMS_ДанныеФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьФИЛФизЛиц() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК ФизЛицо,
		|	Контрагенты.ДатаРождения КАК ДатаРождения,
		|	Контрагенты.Пол КАК Пол
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
		|	И Контрагенты.Наименование <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПотенциальныеКонтрагенты.Ссылка,
		|	ПотенциальныеКонтрагенты.ДатаРождения,
		|	ПотенциальныеКонтрагенты.Пол
		|ИЗ
		|	Справочник.CRM_ПотенциальныеКонтрагенты КАК ПотенциальныеКонтрагенты
		|ГДЕ
		|	ПотенциальныеКонтрагенты.Наименование <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизическиеЛица.Ссылка,
		|	ФизическиеЛица.ДатаРождения,
		|	ФизическиеЛица.Пол
		|ИЗ
		|	Справочник.Renault_ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаФизЛиц = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаФизЛиц.Следующий() Цикл
		DMS_ФизическиеЛицаСервер.ЗаписатьФИОФизическогоЛица(ВыборкаФизЛиц.ФизЛицо,ВыборкаФизЛиц.Пол,ВыборкаФизЛиц.ДатаРождения);	
	КонецЦикла;
	
	Попытка
		ПереформироватьФИО();
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("Переформирование ФИО",УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры 

Процедура ПереформироватьФИО()
	ЗагрузитьИменаИОтчества();
КонецПроцедуры

Процедура ЗагрузитьИменаИОтчества()
					                                      
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаИменИОтчеств.Значение КАК Значение,
		|	ТаблицаИменИОтчеств.Тип КАК Тип
		|ПОМЕСТИТЬ мТаблица
		|ИЗ
		|	РегистрСведений.DMS_СправочнаяИнформацияПоФИО КАК ТаблицаИменИОтчеств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	мТаблица.Значение КАК Значение,
		|	мТаблица.Тип КАК Тип,                                 
		|	ДанныеФизическихЛиц.ФизическоеЛицо,
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	мТаблица КАК мТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО (мТаблица.Тип = Значение(Перечисление.DMS_ТипыЗначенийФИО.Отчество))
		|			И (мТаблица.Значение = ДанныеФизическихЛиц.Имя
		|				ИЛИ мТаблица.Значение = ДанныеФизическихЛиц.Фамилия)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	мТаблица.Значение,
		|	мТаблица.Тип,
		|	ДанныеФизическихЛиц.ФизическоеЛицо,
		|	ДанныеФизическихЛиц.Фамилия,
		|	ДанныеФизическихЛиц.Имя,
		|	ДанныеФизическихЛиц.Отчество
		|ИЗ
		|	мТаблица КАК мТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DMS_ДанныеФизическихЛиц КАК ДанныеФизическихЛиц
		|		ПО (мТаблица.Тип = Значение(Перечисление.DMS_ТипыЗначенийФИО.Имя))
		|			И (мТаблица.Значение = ДанныеФизическихЛиц.Отчество
		|				ИЛИ мТаблица.Значение = ДанныеФизическихЛиц.Фамилия)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мТаблица.Значение,
		|	мТаблица.Тип
		|ИЗ
		|	мТаблица КАК мТаблица";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНесоответствий = РезультатЗапроса[1].Выбрать();
	ВыборкаИменОтчества	  = РезультатЗапроса[2].Выбрать();
		
	Пока ВыборкаНесоответствий.Следующий() Цикл
		
		ВыборкаИменОтчества.Сбросить();
		
		Если СтрДлина(СокрЛП(ВыборкаНесоответствий.Отчество)) = 1 
			И СтрДлина(СокрЛП(ВыборкаНесоответствий.Имя)) = 1 Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ВыборкаНесоответствий.Тип = Перечисления.DMS_ТипыЗначенийФИО.Отчество Тогда
						
			СтруктураПоиска = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Отчество,ВыборкаНесоответствий.Отчество);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоиска) Тогда
				Продолжить;
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			НовоеОтчество = ВыборкаНесоответствий.Значение;
			
			СтруктураПоиска = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Имя,ВыборкаНесоответствий.Имя);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоиска) Тогда
				НовоеИмя = ВыборкаНесоответствий.Имя;
			Иначе 
				НовоеИмя = "НеУказан";
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			СтруктураПоискаИмя 		= Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Имя,		ВыборкаНесоответствий.Фамилия);
			СтруктураПоискаОтчество = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Отчество, ВыборкаНесоответствий.Фамилия);
			
			НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Фамилия);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоискаИмя) Тогда 
				
				Если НовоеИмя = "НеУказан" Тогда
					НовоеИмя = СокрЛП(ВыборкаНесоответствий.Фамилия);
				КонецЕсли; 
				
				НоваяФамилия = "НеУказан";
				
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоискаОтчество) Тогда 
				
				Если НовоеОтчество = "НеУказан" Тогда
					НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Фамилия);
				КонецЕсли; 
				
				НоваяФамилия = "НеУказан";
				
			КонецЕсли; 
			
			Если СокрЛП(НоваяФамилия) = СокрЛП(ВыборкаНесоответствий.Фамилия)
				И СокрЛП(НовоеИмя) = СокрЛП(ВыборкаНесоответствий.Имя) Тогда
				НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Отчество);
			КонецЕсли;
			
			НовоеФИО = НоваяФамилия + " " + НовоеИмя + " " + НовоеОтчество;
			
			Если НоваяФамилия = "НеУказан" Тогда
			
				Если Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Фамилия)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Фамилия);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Отчество)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Отчество);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Имя)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Имя);
				КонецЕсли;
			
			КонецЕсли; 
			
			НовоеФИО = НоваяФамилия + " " + НовоеИмя + " " + НовоеОтчество;
			
			НовоеФИО = СокрЛП(СтрЗаменить(НовоеФИО,"НеУказан",""));
			
			СформироватьФИОВРегистре(ВыборкаНесоответствий.ФизическоеЛицо,НовоеФИО,СокрЛП(СтрЗаменить(НоваяФамилия,"НеУказан","")),СокрЛП(СтрЗаменить(НовоеИмя,"НеУказан","")),СокрЛП(СтрЗаменить(НовоеОтчество,"НеУказан","")));
			
			НовоеФИО = "";
			
		ИначеЕсли ВыборкаНесоответствий.Тип = Перечисления.DMS_ТипыЗначенийФИО.Имя Тогда 	
			
			СтруктураПоиска = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Имя,ВыборкаНесоответствий.Имя);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоиска) Тогда
				Продолжить;
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			НовоеИмя = ВыборкаНесоответствий.Значение;
			
			СтруктураПоиска = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Отчество,ВыборкаНесоответствий.Отчество);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоиска) Тогда
				НовоеОтчество = ВыборкаНесоответствий.Отчество;
			Иначе 
				НовоеОтчество = "НеУказан";
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			СтруктураПоискаИмя 		= Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Имя, ВыборкаНесоответствий.Фамилия);
			СтруктураПоискаОтчество = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Отчество, ВыборкаНесоответствий.Фамилия);
			
			НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Фамилия);
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоискаИмя) Тогда 
				
				Если НовоеИмя = "НеУказан" Тогда
					НовоеИмя = СокрЛП(ВыборкаНесоответствий.Фамилия);
				КонецЕсли; 
				
				НоваяФамилия = "НеУказан";
				
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоискаОтчество) Тогда 
				
				Если НовоеОтчество = "НеУказан" Тогда
					НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Фамилия);
				КонецЕсли; 
				
				НоваяФамилия = "НеУказан";
				
			КонецЕсли; 
			
			ВыборкаИменОтчества.Сбросить();
			
			Если СокрЛП(НоваяФамилия) = СокрЛП(ВыборкаНесоответствий.Фамилия)
				И СокрЛП(НовоеОтчество) = СокрЛП(ВыборкаНесоответствий.Отчество) Тогда
				НовоеИмя = СокрЛП(ВыборкаНесоответствий.Имя);
			КонецЕсли;
			
			НовоеФИО = НоваяФамилия + " " + НовоеИмя + " " + НовоеОтчество;
			
			Если НоваяФамилия = "НеУказан" Тогда
			
				Если Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Фамилия)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Фамилия);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Отчество)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Отчество);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Имя)) = 0 Тогда
					НоваяФамилия = СокрЛП(ВыборкаНесоответствий.Имя);
				КонецЕсли;
				
				Если НовоеОтчество = "НеУказан" Тогда
					
					СтруктураПоискаОтчество = Новый Структура("Тип,Значение",Перечисления.DMS_ТипыЗначенийФИО.Отчество, НоваяФамилия);
										
					Если ВыборкаИменОтчества.НайтиСледующий(СтруктураПоискаОтчество) Тогда 
						
						НовоеОтчество = СокрЛП(НоваяФамилия);
						
						НоваяФамилия = "НеУказан";
						
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли; 
			
			НовоеФИО = НоваяФамилия + " " + НовоеИмя + " " + НовоеОтчество;
			
			Если НовоеОтчество = "НеУказан" Тогда
			
				Если Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Фамилия)) = 0 Тогда
					НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Фамилия);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Отчество)) = 0 Тогда
					НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Отчество);
				ИначеЕсли Найти(НовоеФИО,СокрЛП(ВыборкаНесоответствий.Имя)) = 0 Тогда
					НовоеОтчество = СокрЛП(ВыборкаНесоответствий.Имя);
				КонецЕсли;
				
			КонецЕсли; 
			
			НовоеФИО = НоваяФамилия + " " + НовоеИмя + " " + НовоеОтчество;
			
			НовоеФИО = СокрЛП(СтрЗаменить(НовоеФИО,"НеУказан",""));
			
			СформироватьФИОВРегистре(ВыборкаНесоответствий.ФизическоеЛицо,НовоеФИО,СокрЛП(СтрЗаменить(НоваяФамилия,"НеУказан","")),СокрЛП(СтрЗаменить(НовоеИмя,"НеУказан","")),СокрЛП(СтрЗаменить(НовоеОтчество,"НеУказан","")));
			
			НовоеФИО = "";
                                                         
		КонецЕсли; 
		
	КонецЦикла; 
		
КонецПроцедуры

Процедура СформироватьФИОВРегистре(ФизическоеЛицо,ФИО,Фамилия,Имя,Отчество)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Имя", 			Имя);
	Запрос.УстановитьПараметр("Отчество", 		Отчество);
	Запрос.УстановитьПараметр("Фамилия", 		Фамилия);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("ФИО", 			ФИО);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_ДанныеФизическихЛиц.ФизическоеЛицо,
		|	&ФИО,
		|	&Фамилия,
		|	&Имя,
		|	&Отчество,
		|	DMS_ДанныеФизическихЛиц.Пол,
		|	DMS_ДанныеФизическихЛиц.ДатаРождения
		|ИЗ
		|	РегистрСведений.DMS_ДанныеФизическихЛиц КАК DMS_ДанныеФизическихЛиц
		|ГДЕ
		|	DMS_ДанныеФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		
		НаборЗаписей = РегистрыСведений.DMS_ДанныеФизическихЛиц.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ВыборкаДетальныеЗаписи.ФизическоеЛицо);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаДетальныеЗаписи);
		
		НаборЗаписей.Записать(Истина);
				
	КонецЕсли;

КонецПроцедуры

//#КонецОбласти

#КонецЕсли
